app/controllers/artists_controller.rb

INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Pharrell"], ["created_at", "2017-07-23 21:16:52.003234"], ["updated_at", "2017-07-23 21:16:52.003234"]]
---
  def create
    @artist = Artist.new(artist_params)

    if @artist.save