app/controllers/songs_controller.rb

SELECT "artists".* FROM "artists"
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 1], ["id", 1]]
---
  def edit
    if params[:artist_id]
      @artist_id_given = true

      if !Artist.exists?(params[:artist_id])
        redirect_to artists_path, alert: "Artist not found."
      else
        artist = Artist.find(params[:artist_id])
        @song = artist.songs.find_by(id: params[:id])

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 18]]
UPDATE "songs" SET "artist_id" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["artist_id", 14], ["updated_at", "2017-07-23 20:41:48.823921"], ["id", 20]]
---
  def update
    binding.pry
    @song = Song.find(params[:id])

    @song.update(song_params)